// خلاصة حكم المحدث - ruling
// الراوي - narrator
// المحدث - compiler
// المصدر - source
const hadiths = [
    {
        text: "ضربَ اللهُ تعالى مثلًا صراطًا مستقيمًا ، وعلى جنْبَتَيِ الصراطِ سورانِ ، فيهما أبوابٌ مُفَتَّحَةُ ، وعلَى الأبوابِ ستورٌ مُرْخَاةٌ ، وعلى بابِ الصراطِ داعِ يقولُ : يا أيُّها الناسُ ! ادخلوا الصراطَ جميعًا ولَا تَتَعَوَّجوا ، وداعٍ يدعُو مِنْ فَوْقِ الصراطِ ، فإذا أرادَ الإِنسانُ أنْ يفتحَ شيئًا مِنْ تِلْكَ الأبْوابِ قال : وَيْحَكَ لا تَفْتَحْهُ ، فإِنَّكَ إِنْ تَفْتَحْهُ تَلِجْهُ ، فالصراطُ الإسلامُ ، والسُّورانِ حدودُ اللهِ ، والأبوابُ الْمُفَتَّحَةُ محارِمُ اللهِ تعالى ، وذلِكَ الدَّاعِي على رأسِ الصراطِ كتابُ اللهِ ، والداعي مِنْ فوقٍ واعظُ اللهِ في قلْبِ كُلِّ مسلِمٍ",
        ruling: "صحيح",
        narrator: "النواس بن سمعان الأنصاري",
        compiler: "الألباني",
        source: "صحيح الجامع",
        dorar_source: "https://dorar.net/hadith/sharh/114236"
    },
    {
        text: "إنَّما الأعمالُ بالنِّيَّاتِ وإنَّما لِكلِّ امرئٍ ما نوى فمن كانت هجرتُهُ إلى اللَّهِ ورسولِهِ فَهجرتُهُ إلى اللَّهِ ورسولِهِ ومن كانت هجرتُهُ إلى دنيا يصيبُها أو امرأةٍ ينْكحُها فَهجرتُهُ إلى ما هاجرَ إليْهِ",
        ruling: "صحيح",
        narrator: "عمر بن الخطاب",
        compiler: "ابن تيمية",
        source: "مجموع الفتاوى",
        dorar_source: "https://dorar.net/hadith/sharh/114236"
    },
    {
        text: "لأعلمنَّ أقوامًا من أمتي يأتون يومَ القيامةِ بحسناتٍ أمثالِ جبالِ تهامةَ بيضًا فيجعلُها اللهُ عزَّ وجلَّ هباءً منثورًا قال ثوبانُ يا رسولَ اللهِ صِفْهم لنا جَلِّهم لنا أن لا نكونَ منهم ونحنُ لا نعلمُ قال أما إنهم إخوانُكم ومن جِلدتِكم ويأخذون من الليلِ كما تأخذون ولكنَّهم أقوامٌ إذا خَلْوا بمحارمِ اللهِ انتهكُوها",

        ruling: "صحيح",
        narrator: "ثوبان مولى رسول الله صلى الله عليه وسلم",
        compiler: "الألباني",
        source: "صحيح ابن ماجه",
        dorar_source: "https://dorar.net/h/gaq2N6ch"
    },
    {
        text: "استحيوا من اللهِ تعالى حقَّ الحياءِ ، من اسْتحيا من اللهِ حقَّ الحياءِ فلْيحفظِ الرأسَ وما وعى ، ولْيحفظِ البطنَ وما حوى ، ولْيذكرِ الموتَ والبِلا ، ومن أراد الآخرةَ ترك زينةَ الحياةِ الدنيا ، فمن فعل ذلك فقد استحيا من اللهِ حق الحياءِ",
        ruling: "حسن",
        narrator: "عبدالله بن مسعود",
        compiler: "الألباني",
        source: "صحيح الجامع",
        dorar_source: "https://dorar.net/hadith/sharh/83137"
    }
];
